FORTIGATE FIREWALL BASIC CONFIGURATION
__________________________________________

FortiGate-VM64-KVM # show system

no object in the end
Command fail. Return code -160

FortiGate-VM64-KVM # show system interface
name    Name.
fortilink   static   0.0.0.0 0.0.0.0  10.255.1.1 255.255.255.0  up   disable   aggregate  enable
port1   dhcp   0.0.0.0 0.0.0.0  192.168.208.130 255.255.255.0  up   disable   physical  enable
port2   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port3   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port4   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port5   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port6   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port7   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port8   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port9   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
port10   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   physical  enable
ssl.root   static   0.0.0.0 0.0.0.0  0.0.0.0 0.0.0.0  up   disable   tunnel  enable

FortiGate-VM64-KVM # config system interface

FortiGate-VM64-KVM (interface) # edit port1

FortiGate-VM64-KVM (port1) # set allowaccess http https ping ssh

FortiGate-VM64-KVM (port1) # end

--------------------------------------------------------------------------------------------------------------------------------------------

PC1

PC1> ip 192.168.1.1/24 192.168.1.100
Checking for duplicate address...
PC1 : 192.168.1.1 255.255.255.0 gateway 192.168.1.100

PC1>
PC1>
PC1>
PC1> ping 192.168.2.1
84 bytes from 192.168.2.1 icmp_seq=1 ttl=254 time=64.790 ms
84 bytes from 192.168.2.1 icmp_seq=2 ttl=254 time=16.639 ms
84 bytes from 192.168.2.1 icmp_seq=3 ttl=254 time=16.865 ms
84 bytes from 192.168.2.1 icmp_seq=4 ttl=254 time=17.183 ms
84 bytes from 192.168.2.1 icmp_seq=5 ttl=254 time=17.006 ms

--------------------------------------------------------------------------------------------------------------------------------------------

ROUTER 1

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#do sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
R1(config)#int f0/0
R1(config-if)#ip add 192.168.2.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#ex
R1(config)#
*Aug  8 22:08:39.643: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Aug  8 22:08:40.643: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R1(config)#ip route 0.0.0.0 0.0.0.0 192.168.2.100
R1(config)#do sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 192.168.2.100 to network 0.0.0.0

S*    0.0.0.0/0 [1/0] via 192.168.2.100
      192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.2.0/24 is directly connected, FastEthernet0/0
L        192.168.2.1/32 is directly connected, FastEthernet0/0
R1(config)#T{R}X
R1#}p
R1#
*Aug  8 22:23:26.603: %SYS-5-CONFIG_I: Configured from console by console
R1#
R1#
R1#
R1#en
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#do ping 192.168.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/21/32 ms
R1(config)#
